/*Ввести з клавіатури 6-и значне число. Перевірити чи це число може бути записом числа
в 5-тірковій системі числення. Якщо так, вивести його значення у 10-вій системі
числення*/
#include <stdio.h>
#include <math.h>

int main() {
    printf("Please enter six digit number: ");
    int number6;      // берем наше число
    scanf("%d", &number6);


    printf("\n");

    int c = number6;
    int i;  //для майбутньої остачі
    int g = number6;

    //створюваання подібності до ділення в стовбчик
   //як мені оце перемістити в цикл
        int x = c / 5; //створюєм перемінну дkz того щоб знайти остачу
        x = x * 5;  //множення для того того щоб потім відняти
        i = g - x;
        printf("%d", i);
}
